import lombok.AllArgsConstructor;
import lombok.Getter;

import java.util.stream.Stream;

/**
 * @author func 18.01.2020
 */
@Getter
@AllArgsConstructor
public enum Country {
    // todo: Переделать на англ и добавить поле с названием (мне лень просто в переводчик лезть)
    ЛИМБ(0, "Ошибка", "Ошибка"),
    БЕЛОРРУСЬ(1, "Население Белоруссии: 9,508 миллиона (2017 г.).", "Столица Белоруссии: Минск."),
    БЕЛЬГИЯ(2, "Население Бельгии: 11,4 миллиона (2018 г.).", "Столица Бельгии: ."),
    БРИТАНИЯ(3, "Население Велекобританиии: 66,44 миллиона (2018 г.).", "Столица Велекобританиии: Лондон."),
    ГЕРМАНИЯ(4, "Население Германии: 82,79 миллиона (2018 г.).", "Столица Германии: Берлин."),
    ИРАН(5, "Население Ирана: 81,16 миллиона (2017 г.).", "Столица Ирана: Тегеран."),
    КАЗАХСТАН(6, "Население Казахстана: 18,04 миллиона (2017 г.).", "Столица Казахстана: Нур-Султан."),
    КИРГИЗИЯ(7, "Население Киргизии: 6,202 миллиона (2017 г.).", "Столица Киргизии: Бишкек."),
    КИТАЙ(8, "Население Китая: 1,386 миллиарда (2017 г.).", "Столица Китая: Пекин."),
    МЕКСИКА(9, "Население Мексики: 129,2 миллиона (2017 г.).", "Столица Мексики: Мехико."),
    МОНГОЛИЯ(10, "Население Монголии: 3,076 миллиона (2017 г.).", "Столица Монголии: Улан-Батор."),
    НИДЕРЛАНДЫ(11, "Население Нидерландов: 17,18 миллиона (2018 г.).", "Столица Нидерландов: Амстердам."),
    РОССИИ(12, "Население России: 144,5 миллиона (2017 г.).", "Столица России: Москва."),
    США(13, "Население США: 327,2 миллиона (2018 г.).", "Столица США: Вашингтон."),
    ТАДЖИКИСТАН(14, "Население Таджикистана: 8,921 миллиона (2017 г.).", "Столица Таджикистана: Душанбе."),
    УЗБЕКИСТАН(15, "Население Узбекистана: 32,39 миллиона (2017 г.).", "Столица Узбекистана: Ташкент."),
    УКРАИНА(16, "Население Украины: 42,22 миллиона (2018 г..).", "Столица Украины: Киев."),
    ФРАНЦИЯ(17, "Население Франции: 66,99 миллиона (2019 г.).", "Столица Франции: Париж."),
    ШОТЛАНДИЯ(18, "Население Шотландии: 5,438 миллиона (2018 г.).", "Столица Шотландии: Эдинбург."),
    ЯМАЙА(19, "Население Ямайки: 2,89 миллиона (2017 г.).", "Столица Ямайки: Кингстон."),
    ЯПОНИЯ(20, "Население Японии: 126,8 миллиона (2017 г.).", "Столица Японии: Токио."),
    ;

    private int number;
    private String info;
    private String capital;

    public static Country getCountryByNumber(int number) {
        return Stream.of(Country.values())
                .filter(country -> country.getNumber() == number)
                .findAny()
                .orElse(ЛИМБ);
    }
    public static void showChoices() {
        System.out.print("Выберите цифру ");
        for (int i = 1; i < Country.values().length; i++) {
            System.out.printf("[%d],", i);
        }
        System.out.print(Ansi.ANSI_RESET.toString() + Ansi.ANSI_GREEN.toString());
        for (int i = 1; i < Country.values().length; i++) {
            System.out.printf("\n%02d-%s.", i, Country.values()[i].name());
        }
        System.out.print(Ansi.ANSI_RESET.toString() + Ansi.ANSI_GREEN.toString());
        System.out.println();
        System.out.println(Ansi.ANSI_BLUE + "Выберите: " + Ansi.ANSI_RESET);
    }
}
