import lombok.AllArgsConstructor;
import lombok.Getter;

import java.util.stream.Stream;

/**
 * @author func 18.01.2020
 */
@Getter
@AllArgsConstructor
public enum Country {
    LIMB(0, "Ошибка", "Ошибка", "Ошибка"),
    BELARUS(1, "Беларусь", "Население Белоруссии: 9,508 миллиона (2017 г.).", "Столица Белоруссии: Минск."),
    BELGIUM(2, "Бельгия", "Население Бельгии: 11,4 миллиона (2018 г.).", "Столица Бельгии: ."),
    BRITANNIA(3,"Британия",  "Население Велекобританиии: 66,44 миллиона (2018 г.).", "Столица Велекобританиии: Лондон."),
    GERMANY(4, "Германия", "Население Германии: 82,79 миллиона (2018 г.).", "Столица Германии: Берлин."),
    IRAN(5, "Иран", "Население Ирана: 81,16 миллиона (2017 г.).", "Столица Ирана: Тегеран."),
    KAZAKHSTAN(6,"Казахстан",  "Население Казахстана: 18,04 миллиона (2017 г.).", "Столица Казахстана: Нур-Султан."),
    KYRGYZSTAN(7, "Киргизия", "Население Киргизии: 6,202 миллиона (2017 г.).", "Столица Киргизии: Бишкек."),
    CHINA(8, "Китай", "Население Китая: 1,386 миллиарда (2017 г.).", "Столица Китая: Пекин."),
    MEXICO(9, "Мексика", "Население Мексики: 129,2 миллиона (2017 г.).", "Столица Мексики: Мехико."),
    MONGOLIA(10, "Монголия", "Население Монголии: 3,076 миллиона (2017 г.).", "Столица Монголии: Улан-Батор."),
    NETHERLANDS(11, "Нидерланды", "Население Нидерландов: 17,18 миллиона (2018 г.).", "Столица Нидерландов: Амстердам."),
    RUSSIA(12, "Россия", "Население России: 144,5 миллиона (2017 г.).", "Столица России: Москва."),
    USA(13, "США", "Население США: 327,2 миллиона (2018 г.).", "Столица США: Вашингтон."),
    TAJIKISTAN(14, "Таджикистан", "Население Таджикистана: 8,921 миллиона (2017 г.).", "Столица Таджикистана: Душанбе."),
    UZBEKISTAN(15,"Узбекистан",  "Население Узбекистана: 32,39 миллиона (2017 г.).", "Столица Узбекистана: Ташкент."),
    UKRAINE(16, "Украина", "Население Украины: 42,22 миллиона (2018 г..).", "Столица Украины: Киев."),
    FRANCE(17, "Франция", "Население Франции: 66,99 миллиона (2019 г.).", "Столица Франции: Париж."),
    SCOTLAND(18, "Шотландия", "Население Шотландии: 5,438 миллиона (2018 г.).", "Столица Шотландии: Эдинбург."),
    JAMAICA(19, "Ямайка", "Население Ямайки: 2,89 миллиона (2017 г.).", "Столица Ямайки: Кингстон."),
    JAPAN(20, "Япония", "Население Японии: 126,8 миллиона (2017 г.).", "Столица Японии: Токио."),
    ;

    private int number;
    private String name;
    private String info;
    private String capital;

    public static Country getCountryByNumber(int number) {
        return Stream.of(Country.values())
                .filter(country -> country.getNumber() == number)
                .findAny()
                .orElse(LIMB);
    }
    public static void showChoices() {
        System.out.print("Выберите цифру ");
        for (int i = 1; i < Country.values().length; i++) {
            System.out.printf("[%d],", i);
        }
        System.out.print(Ansi.ANSI_RESET.toString() + Ansi.ANSI_GREEN.toString());
        for (int i = 1; i < Country.values().length; i++) {
            System.out.printf("\n%02d-%s.", i, Country.values()[i].getName());
        }
        System.out.print(Ansi.ANSI_RESET.toString() + Ansi.ANSI_GREEN.toString());
        System.out.println();
        System.out.println(Ansi.ANSI_BLUE + "Выберите: " + Ansi.ANSI_RESET);
    }
}